pamirmundt/Argon-Main/main/STM32/main/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f3xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;

I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim15;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
volatile uint16_t prev_capture_TIM2_CH1 = 0;
volatile uint16_t prev_capture_TIM2_CH2 = 0;
volatile uint16_t prev_capture_TIM2_CH3 = 0;
volatile uint16_t prev_capture_TIM2_CH4 = 0;
volatile uint16_t delta_clk_TIM2_CH1 = 0;
volatile uint16_t delta_clk_TIM2_CH2 = 0;
volatile uint16_t delta_clk_TIM2_CH3 = 0;
volatile uint16_t delta_clk_TIM2_CH4 = 0;

volatile uint16_t prev_capture_TIM3_CH1 = 0;
volatile uint16_t prev_capture_TIM3_CH2 = 0;
volatile uint16_t prev_capture_TIM3_CH3 = 0;
volatile uint16_t prev_capture_TIM3_CH4 = 0;
volatile uint16_t delta_clk_TIM3_CH1 = 0;
volatile uint16_t delta_clk_TIM3_CH2 = 0;
volatile uint16_t delta_clk_TIM3_CH3 = 0;
volatile uint16_t delta_clk_TIM3_CH4 = 0;

volatile int16_t encoder_count_CH1 = 0;
volatile int16_t encoder_count_CH2 = 0;
volatile int16_t encoder_count_CH3 = 0;
volatile int16_t encoder_count_CH4 = 0;

volatile int16_t prev_encoder_count_CH1 = 0;
volatile int16_t prev_encoder_count_CH2 = 0;
volatile int16_t prev_encoder_count_CH3 = 0;
volatile int16_t prev_encoder_count_CH4 = 0;

volatile float RPM_CH1 = 0.0f;
volatile float RPM_CH2 = 0.0f;
volatile float RPM_CH3 = 0.0f;
volatile float RPM_CH4 = 0.0f;

volatile uint8_t timeout_CH1 = 0;
volatile uint8_t timeout_CH2 = 0;
volatile uint8_t timeout_CH3 = 0;
volatile uint8_t timeout_CH4 = 0;

//volatile uint16_t input_capture_TIM3_CH1 = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM2_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM15_Init(void);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_TIM1_Init();
  MX_TIM3_Init();
  MX_TIM2_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  MX_I2C1_Init();
  MX_TIM15_Init();

  /* USER CODE BEGIN 2 */
	HAL_TIM_PWM_Start_IT(&htim1, TIM_CHANNEL_1);
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 512);
	
	HAL_TIM_PWM_Start_IT(&htim1, TIM_CHANNEL_2);
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, 1024);
	
	HAL_TIM_PWM_Start_IT(&htim1, TIM_CHANNEL_3);
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 2000);
	
	HAL_TIM_PWM_Start_IT(&htim1, TIM_CHANNEL_4);
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, 3000);


	HAL_TIM_IC_Start_IT(&htim2, TIM_CHANNEL_1);
	HAL_TIM_IC_Start_IT(&htim2, TIM_CHANNEL_2);
	HAL_TIM_IC_Start_IT(&htim2, TIM_CHANNEL_3);
	HAL_TIM_IC_Start_IT(&htim2, TIM_CHANNEL_4);
	
	HAL_TIM_IC_Start_IT(&htim3, TIM_CHANNEL_1);
	HAL_TIM_IC_Start_IT(&htim3, TIM_CHANNEL_2);
	HAL_TIM_IC_Start_IT(&htim3, TIM_CHANNEL_3);
	HAL_TIM_IC_Start_IT(&htim3, TIM_CHANNEL_4);
	
	HAL_TIM_Base_Start_IT(&htim15);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
		//HAL_GPIO_TogglePin(GPIOF, GPIO_PIN_1);
		//GPIOF->BSRR = GPIO_BSRR_BS_1;
		//GPIOF->BSRR = GPIO_BSRR_BR_1;	
  }
  /* USER CODE END 3 */
}

