pamirmundt/Argon-Main/main/STM32/main/Src/main.c
}

/* USER CODE BEGIN 4 */

void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim){
	GPIOF->BSRR = GPIO_BSRR_BS_1;
	if(htim->Instance == TIM2){
		//Timer 2 - Channel 1
		if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1){
			encoder_count_CH1++;
			
			uint16_t input_capture_TIM2_CH1 = HAL_TIM_ReadCapturedValue(&htim2, TIM_CHANNEL_1);	//read TIM2 channel 1 capture value
			delta_clk_TIM2_CH1 = input_capture_TIM2_CH1 - prev_capture_TIM2_CH1;
			prev_capture_TIM2_CH1 = input_capture_TIM2_CH1;
		}
		
		//Timer 2 - Channel 2
		else if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_2){
			encoder_count_CH2++;
			
			uint16_t input_capture_TIM2_CH2 = HAL_TIM_ReadCapturedValue(&htim2, TIM_CHANNEL_2);	//read TIM2 channel 2 capture value
			delta_clk_TIM2_CH2 = input_capture_TIM2_CH2 - prev_capture_TIM2_CH2;
			prev_capture_TIM2_CH2 = input_capture_TIM2_CH2;
		}
		
		//Timer 2 - Channel 3
		else if(htim->Channel == HAL_TIM_ACTIVE_CHANNEL_3){
			encoder_count_CH3++;
			
			uint16_t input_capture_TIM2_CH3 = HAL_TIM_ReadCapturedValue(&htim2, TIM_CHANNEL_3);	//read TIM2 channel 3 capture value
			delta_clk_TIM2_CH3 = input_capture_TIM2_CH3 - prev_capture_TIM2_CH3;
			prev_capture_TIM2_CH3 = input_capture_TIM2_CH3;
		}
		
		//Timer 2 - Channel 4
		else if(htim->Channel == HAL_TIM_ACTIVE_CHANNEL_4){
			encoder_count_CH4++;
			
			uint16_t input_capture_TIM2_CH4 = HAL_TIM_ReadCapturedValue(&htim2, TIM_CHANNEL_4);	//read TIM2 channel 4 capture value
			delta_clk_TIM2_CH4 = input_capture_TIM2_CH4 - prev_capture_TIM2_CH4;
			prev_capture_TIM2_CH4 = input_capture_TIM2_CH4;
		}
	}
	
	else if(htim->Instance == TIM3){
		//Timer 3 - Channel 1
		if(htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1){
			encoder_count_CH1--;
			
			uint16_t input_capture_TIM3_CH1 = HAL_TIM_ReadCapturedValue(&htim3, TIM_CHANNEL_1);	//read TIM3 channel 1 capture value
			delta_clk_TIM3_CH1 = input_capture_TIM3_CH1 - prev_capture_TIM3_CH1;
			prev_capture_TIM3_CH1 = input_capture_TIM3_CH1;	
		}
		
		//Timer 3 - Channel 2
		else if(htim->Channel == HAL_TIM_ACTIVE_CHANNEL_2){
			encoder_count_CH2--;
			
			uint16_t input_capture_TIM3_CH2 = HAL_TIM_ReadCapturedValue(&htim3, TIM_CHANNEL_2);	//read TIM3 channel 2 capture value
			delta_clk_TIM3_CH2 = input_capture_TIM3_CH2 - prev_capture_TIM3_CH2;
			prev_capture_TIM3_CH2 = input_capture_TIM3_CH2;
		}
		
		//Timer 3 - Channel 3
		else if(htim->Channel == HAL_TIM_ACTIVE_CHANNEL_3){
			encoder_count_CH3--;
			
			uint16_t input_capture_TIM3_CH3 = HAL_TIM_ReadCapturedValue(&htim3, TIM_CHANNEL_3);	//read TIM3 channel 3 capture value
			delta_clk_TIM3_CH3 = input_capture_TIM3_CH3 - prev_capture_TIM3_CH3;
			prev_capture_TIM3_CH3 = input_capture_TIM3_CH3;
		}
		
		//Timer 3 - Channel 4
		else if(htim->Channel == HAL_TIM_ACTIVE_CHANNEL_4){
			encoder_count_CH4--;
			
			uint16_t input_capture_TIM3_CH4 = HAL_TIM_ReadCapturedValue(&htim3, TIM_CHANNEL_4);	//read TIM3 channel 3 capture value
			delta_clk_TIM3_CH4 = input_capture_TIM3_CH4 - prev_capture_TIM3_CH4;
			prev_capture_TIM3_CH4 = input_capture_TIM3_CH4;
		}
	}
	GPIOF->BSRR = GPIO_BSRR_BR_1;
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	if(htim->Instance == TIM15)
	{
		//---------------------------------
		//	Channel 1 RPM
		//---------------------------------
		
		//Timeout for CH1
		//Checks Encoder Count
		//if there is not change in encoder count in a 1 sec interval, sets RPM to zero
		//timeout = 1/(64Mhz / 16000 Prescaler / 20 Counter Period)
		//timeout = 0.005sec (200Hz)
		int16_t delta_encoder_CH1 = encoder_count_CH1 - prev_encoder_count_CH1;
		if(encoder_count_CH1 == prev_encoder_count_CH1){
			timeout_CH1++;
			if(timeout_CH1 == 200){
				delta_clk_TIM2_CH1 = 0;
				delta_clk_TIM3_CH1 = 0;
				timeout_CH1 = 0;
			}
		}
		else
			timeout_CH1 = 0;
		prev_encoder_count_CH1 = encoder_count_CH1;
		
		//Max velocity for Delta Time
		//Count Limit(timer count) = 64Mhz / 1000Prescale / 200Hz (Velocity calculation loop)
		//320 = 64Mhz / 1000 / 200Hz
		//Timer 2 - Channel 1
		if(delta_clk_TIM2_CH1 >= 320){
			//RPM = 60Sec / ( 64Enc * Delta_time)
			//Delta_time(seconds) = delta_count / (64Mhz / 1000Prescale)
			RPM_CH1 = 60000.0f/(float)delta_clk_TIM2_CH1;
		}
		//Timer 3 - Channel 1
		else if(delta_clk_TIM3_CH1 >= 320){
			//RPM = 60Sec / ( 64Enc * Delta_time)
			//Delta_time(seconds) = delta_count / (64Mhz / 1000Prescale)
			RPM_CH1 = -60000.0f/(float)delta_clk_TIM3_CH1;
		}
		else if((delta_clk_TIM2_CH1 < 320) && (delta_clk_TIM3_CH1 < 320))
			RPM_CH1 = 187.5f*((float)delta_encoder_CH1);
		
		
		//---------------------------------
		//	Channel 2 RPM
		//---------------------------------
		
		//Timeout for CH2
		//Checks Encoder Count
		//if there is not change in encoder count in a 1 sec interval, sets RPM to zero
		//timeout = 1/(64Mhz / 16000 Prescaler / 20 Counter Period)
		//timeout = 0.005sec (200Hz)
		int16_t delta_encoder_CH2 = encoder_count_CH2 - prev_encoder_count_CH2;
		if(encoder_count_CH2 == prev_encoder_count_CH2){
			timeout_CH2++;
			if(timeout_CH2 == 200){
				delta_clk_TIM2_CH2 = 0;
				delta_clk_TIM3_CH2 = 0;
				timeout_CH2 = 0;
			}
		}
		else
			timeout_CH2 = 0;
		prev_encoder_count_CH2 = encoder_count_CH2;
		
		//Max velocity for Delta Time
		//Count Limit(timer count) = 64Mhz / 1000Prescale / 200Hz (Velocity calculation loop)
		//320 = 64Mhz / 1000 / 200Hz
		//Timer 2 - Channel 2
		if(delta_clk_TIM2_CH2 >= 320){
			//RPM = 60Sec / ( 64Enc * Delta_time)
			//Delta_time(seconds) = delta_count / (64Mhz / 1000Prescale)
			RPM_CH2 = 60000.0f/(float)delta_clk_TIM2_CH2;
		}
		//Timer 3 - Channes 3
		else if(delta_clk_TIM3_CH2 >= 320){
			//RPM = 60Sec / ( 64Enc * Delta_time)
			//Delta_time(seconds) = delta_count / (64Mhz / 1000Prescale)
			RPM_CH2 = -60000.0f/(float)delta_clk_TIM3_CH2;
		}
		else if((delta_clk_TIM2_CH2 < 320) && (delta_clk_TIM3_CH2 < 320))
			RPM_CH2 = 187.5f*((float)delta_encoder_CH2);
		
		
		//---------------------------------
		//	Channel 3 RPM
		//---------------------------------
		
		//Timeout for CH3
		//Checks Encoder Count
		//if there is not change in encoder count in a 1 sec interval, sets RPM to zero
		//timeout = 1/(64Mhz / 16000 Prescaler / 20 Counter Period)
		//timeout = 0.005sec (200Hz)
		int16_t delta_encoder_CH3 = encoder_count_CH3 - prev_encoder_count_CH3;
		if(encoder_count_CH3 == prev_encoder_count_CH3){
			timeout_CH3++;
			if(timeout_CH3 == 200){
				delta_clk_TIM2_CH3 = 0;
				delta_clk_TIM3_CH3 = 0;
				timeout_CH3 = 0;
			}
		}
		else
			timeout_CH3 = 0;
		prev_encoder_count_CH3 = encoder_count_CH3;
		
		//Max velocity for Delta Time
		//Count Limit(timer count) = 64Mhz / 1000Prescale / 200Hz (Velocity calculation loop)
		//320 = 64Mhz / 1000 / 200Hz
		//Timer 2 - Channel 3
		if(delta_clk_TIM2_CH3 >= 320){
			//RPM = 60Sec / ( 64Enc * Delta_time)
			//Delta_time(seconds) = delta_count / (64Mhz / 1000Prescale)
			RPM_CH3 = 60000.0f/(float)delta_clk_TIM2_CH3;
		}
		//Timer 3 - Channel 3
		else if(delta_clk_TIM3_CH3 >= 320){
			//RPM = 60Sec / ( 64Enc * Delta_time)
			//Delta_time(seconds) = delta_count / (64Mhz / 1000Prescale)
			RPM_CH3 = -60000.0f/(float)delta_clk_TIM3_CH3;
		}
		else if((delta_clk_TIM2_CH3 < 320) && (delta_clk_TIM3_CH3 < 320))
			RPM_CH3 = 187.5f*((float)delta_encoder_CH3);
		
		
		//---------------------------------
		//	Channel 4 RPM
		//---------------------------------
		
