pamirmundt/Argon-Main/main/STM32/main/Src/main.c
		//Timeout for CH4
		//Checks Encoder Count
		//if there is not change in encoder count in a 1 sec interval, sets RPM to zero
		//timeout = 1/(64Mhz / 16000 Prescaler / 20 Counter Period)
		//timeout = 0.005sec (200Hz)
		int16_t delta_encoder_CH4 = encoder_count_CH4 - prev_encoder_count_CH4;
		if(encoder_count_CH4 == prev_encoder_count_CH4){
			timeout_CH4++;
			if(timeout_CH4 == 200){
				delta_clk_TIM2_CH4 = 0;
				delta_clk_TIM3_CH4 = 0;
				timeout_CH4 = 0;
			}
		}
		else
			timeout_CH4 = 0;
		prev_encoder_count_CH4 = encoder_count_CH4;
		
		//Max velocity for Delta Time
		//Count Limit(timer count) = 64Mhz / 1000Prescale / 200Hz (Velocity calculation loop)
		//320 = 64Mhz / 1000 / 200Hz
		if(delta_clk_TIM2_CH4 >= 320){
			//RPM = 60Sec / ( 64Enc * Delta_time)
			//Delta_time(seconds) = delta_count / (64Mhz / 1000Prescale)
			RPM_CH4 = 60000.0f/(float)delta_clk_TIM2_CH4;
		}
		else if(delta_clk_TIM3_CH4 >= 320){
			//RPM = 60Sec / ( 64Enc * Delta_time)
			//Delta_time(seconds) = delta_count / (64Mhz / 1000Prescale)
			RPM_CH4 = -60000.0f/(float)delta_clk_TIM3_CH4;
		}
		else if((delta_clk_TIM2_CH4 < 320) && (delta_clk_TIM3_CH4 < 320))
			RPM_CH4 = 187.5f*((float)delta_encoder_CH4);
	}
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
